// bigint

// bigint는 길이 제한이 없는 정수이다.
// 숫자 데이터가 안정적으로 표시할 수 있는,
// 최대치 {2^53 - 1}보다 큰 정수를 표현할 수 있다.
// 정수 뒤에 'n'을 붙이거나 'BigInt()'를 호출해 생성한다.

console.log(12345678901234567890123456789012345678901234567890); // 1.2345678901234567e+49

console.log(12345678901234567890123456789012345678901234567890n); // 12345678901234567890123456789012345678901234567890n
console.log(BigInt('12345678901234567890123456789012345678901234567890')); // 12345678901234567890123456789012345678901234567890n

const a = 11n;
const b = 22;

console.log(a + BigInt(b)); // 33n
console.log(typeof (a + BigInt(b))); // bigint

console.log(Number(a) + b); // 33
console.log(typeof (Number(a) + b)); // number
